Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Является многомерным Хранилищем данных и позволяет аккумулировать всю необходимую для анализа предметной области информацию.
en: It is a multidimensional Data Warehouse that enables to accumulate all the information required for analysis of the subject area.

source: Является ошибкой I рода.
en: It is type I error.

source: Является ошибкой II рода.
en: It is type II error.

source: Явного импорта функций Калькулятора (как это делается в компоненте JavaScript) делать не нужно.
en: It is not required to import functions of the Calculator distinctly (as it is done in the component of JavaScript).

source: Японские свечи;
en: Candlestick;

source: август
en: August

source: борьба с выбросами и экстремальными значениями — формирование меток интервала квантования при дискретизации непрерывного поля или объединение редких уникальных значений в одну категорию;
en: The struggle against outliers and extreme values is based on formation of the binning range captions during discretization of the continuous field or union of rare unique values into one category.

source: будет заменено на СтрокаЗамены.
en: will be replaced with the ReplaceString.

source: будут заменены на СтрокаЗамены.
en: will be replaced with the ReplaceString.

source: в Loginom для PostgreSQL всегда используется встроенный драйвер.
en: the inbox driver is always used for PostgreSQL in Loginom.

source: в единственном выходном поле — соответствующее этому набору обозначение класса.
en: class identification mapping this set in the only output field.

source: в интервале
en: within the range

source: в качестве макроподстановки — в значении переменной указывается SQL-запрос или какая-то его часть.
en: As macro substitution: the SQL query or its any part is specified as the variable.

source: в качестве параметра — в переменной задается определенное значение.
en: As parameter: a defined value is set for the variable.

source: в контекстном меню элемента «Ссылки» выбрать пункт «Добавить».
en: select "Add" item in the context menu of the "References" item.

source: в окне выбора модификатора доступа задано уникальное в пределах пакета имя узла;
en: The node name that is unique within the package is set in the access modifier selection window;

source: в остальных случаях используется режим выполнения, заданный:
en: in other cases, the following set execution order is used:

source: в параметре «Путь к файлу пакета» задать путь к пакету, доступ к объектам которого необходимо получить;
en: set the path to the package access to which objects it is required to receive in "Path to the package file" parameter;

source: в полях, обозначаемых как входные — множество входных параметров;
en: a set of input parameters in the fields marked as the input ones;

source: в полях, обозначаемых как выходные — соответствующие входным параметрам значения зависимых переменных.
en: the dependent variables values mapping the input parameters in the fields marked as the output ones.

source: в разделе Служебные порты.
en: in the Service Ports section.

source: в случае интерактивного исполнения Сценария — командой, с помощью которой запускается на выполнение сам узел ("Переобучить узел" или "Выполнить узел").
en: in the case of the interactive Workflow execution - by the command that is used to launch the node execution ("Retrain node" or "Run node").

source: в случае пакетного исполнения Сценария — параметром /Teach;
en: in the case of the Workflow batch processing - by /Teach parameter;

source: в списке
en: listed

source: варианты агрегации измерений и фактов;
en: aggregation options of dimensions and measures;

source: взаимозависимы.
en: they are interdependent.

source: вне интервала
en: out of the range

source: вне списка
en: not listed

source: во все строки нового столбца;
en: to all rows of the new column;

source: во входных и выходных портах заданы поля/переменные, определяющие структуру запроса и ответа метода веб-сервиса.
en: The fields/variables that define the request structure and web service method response are set in the input and output ports.

source: восстановление пропусков, когда пропуски образуют отдельную метку интервала квантования или объединяются с соседним, близким по значению WoE-индекса;
en: Null data recovery when null data forms a separate binning range caption, or it is joined with the nearest one that is close by the WoE coefficient value.

source: всегда 0
en: always 0

source: второй вариант — непосредственно щелкнуть левой кнопкой мыши на связь, которую необходимо удалить, и нажать на кнопку Удалить связь удаления связи (Удалить связь при наведении на нее курсора).
en: The second option is to left-click on the link to be deleted, and to press Delete link button to delete the link (when cursor hovering over Delete link).

source: выбрав Быстрый просмотр… из контекстного меню порта;
en: by selecting Quick view… from the context menu of the port;

source: выбрать этот пакет в списке Опубликованные пакеты мастера Публикация пакетов… и нажать кнопку Обновить.
en: Select this package in Published packages list of Publish packages… wizard and press Update button.

source: выдаст ошибку, а при наличии флага обработчик интерпретирует такое объявление как корректное:
en: will cause an error, and when this checkbox is selected, the handler will interpret such notice as the correct one:

source: выделить их поочередно, зажав клавишу Ctrl;
en: it is possible to select them alternately by pressing Ctrl button;

source: выделить первый элемент и затем, зажав клавишу Shift, выделить последний элемент в последовательности файлов.
en: it is possible to select the first item, and then select the last item in the sequence of files by pressing Shift button.

source: выше).
en: above).

source: где $$x$$ — текущее значение, $$x_{min}$$, $$x_{max}$$ — минимальные и максимальные значения поля.
en: where $$x$$ is a current value, $$x_{min}$$, $$x_{max}$$ are minimum and maximum field values.

source: д.
en: etc.

source: далее Список функций).
en: List of functions further);

source: далее Список функций);
en: List of functions further);

source: далее методы квантования), а также использование внешних таблиц с заданными интервалами квантования.
en: binning methods further), and external tables with the set binning ranges can be used.

source: далее).
en: below).

source: дважды кликнуть по выбранному подключению в дереве.
en: double click on the selected connection in the tree.

source: дважды щелкнуть мышью по полю;
en: double click on the field;

source: двойного щелчка мышью по полю;
en: double click on the field;

source: двойным кликом по порту.
en: by double click on the port.

source: для остальных — функция количество.
en: The amount function will be selected for others.

source: для подключения к ClickHouse всегда используется встроенный драйвер.
en: the inbox driver is always used to connect to ClickHouse.

source: для чисел будет выбрана функция сумма;
en: The sum function will be selected for digits.

source: добавленные/измененные вручную.
en: manually added/changed.

source: е.
en: namely,

source: если Временная зона по умолчанию задана, значение преобразуется к текущей временной зоне сервера Loginom в предположении, что имеет временную зону, указанную в параметре Временная зона по умолчанию.
en: If Default time zone is specified, the value is transformed to the current time zone of the Loginom server based on the assumption that it has the time zone specified in the Default time zone parameter.

source: если Временная зона по умолчанию не задана, значение остается без изменений.
en: If Default time zone is not specified, the value is not changed.

source: если при каждом проходе оценить выходную ошибку модели и усреднить ее по всем проходам, то полученная ее оценка будет более достоверной.
en: if the output model error is estimated for each check, and its average value is defined for all checks, its received estimate will be more reliable.

source: если узел находится внутри Подмодели или Цикла, то режим выполнения наследуется от них.
en: if the node is in the Supernode or Loop, the execution mode is inherited from them.

source: ж
en: f

source: задан модификатор доступа Опубликованный;
en: The following access modifier is set: Published;

source: заканчивается на
en: ending with

source: заменять заданным значением — замена аномалий на значение, прописанное вручную;
en: Replace with set value: replace anomalous values with the manually recorded value.

source: заменять медианой — заменять аномалии медианой, вычисленной по столбцу;
en: Replace with median: replace anomalous values with the median calculated for the column.

source: заменять наиболее вероятным — замена аномалий наиболее вероятным значением по столбцу, замена производится на среднее значение из наиболее вероятного интервала, число интервалов варьируется в зависимости от объема выборки — чем она больше, тем больше интервалов;
en: Replace with most frequent: replace anomalous values with the most frequent column value. Replacement is performed using the average value from the most frequent histogram bin. The bin count varies according to the sample size: the larger the sample size, the higher number of bins.

source: заменять средним — заменять аномалии средним значением столбца;
en: Replace with average: replace anomalous values with the average column value.

source: запрос на выборку данных, заданный непосредственно после выполнения узла экспорта с удалением по ключу, может вернуть старые записи.
en: request for data sampling set just after execution of the export node with deletion by key can return the old records.

source: затем по признаку: "совместим тип данных и совпадает метка (без учета регистра)".
en: then by the following indicator: "compatible data type and the caption matches (case-insensitive)".

source: знаки математических операций и отношений;
en: characters of mathematical operations and relations;

source: значение IV;
en: value IV;

source: значение WoE.
en: WoE value.

source: значение для примера
en: example value

source: и (звездочка-слеш).
en: and (asterisk-slash).

source: и от способов агрегации фактов:
en: and on methods of measures aggregation:

source: из набора A, переменная a0
en: from set A, variable a0

source: из набора A, переменная b
en: from set A, variable b

source: из набора B, переменная a0
en: from set B, variable a0

source: из набора B, переменная c
en: from set B, variable c

source: из набора C, переменная a1
en: from set C, variable a1

source: из набора C, переменная b
en: from set C, variable b

source: из панели Навигации выбрав пункт Пакеты.
en: using the Navigation panel, selecting the Packages section.

source: имеются следующими виды вертикального выравнивания:
en: There are the following types of the vertical alignment:

source: имя переменной
en: variable name

source: индекс
en: value

source: использовать кнопку Связать все автоматически, при этом происходит автоматическое связывание входных полей и параметров запроса, исходя из значений меток и типов данных полей входного набора и параметров.
en: Use Auto Link All button. It providies auto linking of the input fields and request parameters based on values of captions and types of fields data of the input data set and parameters.

source: использовать кнопку Связать все автоматически, при этом происходит автоматическое связывание, исходя из значений меток и типов данных полей входной таблицы и элементов схемы XML.
en: Use Auto Link All button. It providies auto linking based on values of captions and types of fields data of the input table and XML schema items.

source: использовать созданные в нем Производные компоненты.
en: use the Derived components created in it.

source: истина
en: true

source: к.
en: as

source: каждый из них отметить флагом в чекбоксе;
en: each of them can be selected with a checkbox;

source: количество Не-событий.
en: Non-events count;

source: количество Событий;
en: Events count;

source: конец
en: end

source: логические операции (and, or, not, xor) и значения (true или 1, false или 0);
en: logical operations (and, or, not, xor) and values (true or 1, false or 0);

source: логические операции (AND, OR, NOT, XOR) и значения (TRUE или 1, FALSE или 0);
en: logical operations (AND, OR, NOT, XOR) and values(TRUE or 1, FALSE or 0);

source: логические операции (AND, OR, NOT, XOR) и значения (TRUE или FALSE);
en: logical operations (AND, OR, NOT, XOR) and values (TRUE or FALSE);

source: ложь
en: false

source: м
en: m

source: на панели «Навигация» выбрать элемент «Ссылки»;
en: select "References" item on the "Navigation" toolbar;

source: нажатием на кнопку Удалить связь на линии связи (при наведении курсора кнопка меняет вид на Удалить связь).
en: using Delete link button in the line (when cursor hovering, the button is changed to Delete link).

source: нажатия кнопки Добавить .
en: by pressing Add button.

source: нажать «Применить».
en: press "Apply".

source: начало
en: start

source: начинается с
en: starting with

source: не заканчивается на
en: not ending with

source: не начинается с
en: not starting with

source: не первый
en: not first

source: не последний
en: not last

source: не постоянный
en: not constant

source: не пустой
en: not null

source: не содержит
en: does not contain

source: о.
en: District

source: обратиться к его объектам при помощи узлов Узел-ссылка, Выполнение узла;
en: refer to its objects using Reference node, Node executionnodes;

source: ограничивать — аномалии будут заменены значением границы, с которой начинается определение аномалии.
en: Limit: replace anomalous values with the bound value from which the anomalous values start.

source: однострочные и многострочные комментарии.
en: single-line and multi-line comments.

source: оно непрерывное и с нулевой дисперсией;
en: It is continuous and with zero variance.

source: оно содержит пропущенные значения.
en: It contains null values.

source: оно является дискретным и содержит всего одно уникальное значение;
en: It is discrete and contains only one unique value.

source: оставить без изменения;
en: Leave unchanged.

source: от -8 до 32
en: from -8 to 32

source: от 1 ТB (+ User Data)
en: from 1 ТB (+ User Data)

source: от 16 до 56
en: from 16 to 56

source: от 28 до 68
en: from 28 to 68

source: от 4 до 44
en: from 4 to 44

source: от 40 до 80
en: from 40 to 80

source: параметр /Node).
en: /Node parameter).

source: параметр Не использовать клиент СУБД ниже):
en: Do not use DBMS client parameter below):

source: параметр Не использовать клиент СУБД).
en: Do not use DBMS client parameter).

source: параметр Точность).
en: Precision parameter).

source: первый
en: first

source: перейдя по кнопке Пакеты в Адресной строке;
en: using the Packages button in Address bar;

source: перетаскивания мышью (Drag-and-drop);
en: drag-and-drop method;

source: перетащить запись из списка Поля сортировки в Доступные поля;
en: move the record from the Sort field list to Available fields;

source: перетащить нужное подключение из дерева (1) в область подключений (2);
en: drag the required connection from tree (1) to area of connections (2);

source: по Максимальному набору;
en: With maximum data set.

source: по Минимальному набору;
en: With minimum data set.

source: поле"Замена"
en: "Replace" field

source: поле"Значение"
en: "Value field"

source: полный путь к пакету: "C:\ProgramData\BaseGroup\Loginom 6\UserStorage\<user>\test.lgp", где <user> — логин пользователя;
en: full path to the package: "C:\ProgramData\BaseGroup\Loginom 6\UserStorage\<user>\test.lgp" where <user> is a user login;

source: последний
en: last

source: постоянный
en: constant

source: преобразование непрерывных и дискретных входных полей, используемых для построения моделей бинарной классификации, путем квантования на основе метода совокупности доказательств или WoE-анализа (weights of evidence, WoE);
en: Conversion of the continuous and discrete input fields used for training of the models related to the binary classification by means of the binning based on totality-of-evidence approach or WoE analysis (weights of evidence, WoE).

source: при активации, переобучении, вызове мастера настройки производного узла или его портов.
en: when activating, retraining, calling the wizard of the derived node or its ports.

source: при выборе в контекстном меню производного узла пункта меню Обновить конфигурацию узла;
en: when selecting Update node configuration menu option in the context menu of the derived node;

source: произвольный текст - 03.04.12
en: user-defined text - 03.04.12

source: произвольный текст - 09.05.12
en: user-defined text - 09.05.12

source: произвольный текст - 16.05.12
en: user-defined text - 16.05.12

source: произвольный текст - 17.04.12
en: user-defined text - 17.04.12

source: произвольный текст - 28.05.12
en: user-defined text - 28.05.12

source: пустой
en: null

source: путем перетаскивания файлов в окно файлового менеджера.
en: by dragging files to the file manager window.

source: путь к пакету внутри файлового хранилища: <user>/test.lgp.
en: path to the package in the file storage: <user>/test.lgp.

source: распределение классов оказывается более равномерным, что улучшает качество обучения;
en: distribution of classes is more uniform that improves the training quality;

source: рисунок 1) или Дерева (см.
en: Figure 1) or Tree (refer to

source: рисунок 1) показывает, какой из вариантов выполнения узла в зависимости от вышеперечисленных настроек будет применен при пакетной обработке:
en: Figure 1) shows which of the node execution options according to the settings specified above will be used for the batch processing:

source: рисунок 1).
en: Figure 1).

source: рисунок 1):
en: Figure 1):

source: рисунок 2 область 1) — дерево классов подключений.
en: Figure 2, Area 1) — Connection Class Tree.

source: рисунок 2) в нижней части диаграммы.
en: Figure 2) in the lower part of the chart.

source: рисунок 2) данные так же представлены в виде входного и выходного наборов полей (или переменных, в зависимости от типа порта).
en: Figure 2) data is also represented in the form of the input and output fields data sets (or variablesaccording to the port type).

source: рисунок 2) предназначен для того, чтобы отобразить базовый узел Производного компонента.
en: Figure 2) is designated to display the base node of the Derived component.

source: рисунок 2).
en: Figure 2).

source: рисунок 2):
en: Figure 2):

source: рисунок 3) позволяет отобразить исходный узел для Узла-ссылки.
en: Figure 3) enables to display the source node for the Reference node.

source: рисунок 3).
en: Figure 3).

source: рисунок 3):
en: Figure 3):

source: рисунок 4) / диаграммы IV.
en: Figure 4) / chart IV.

source: рисунок 4).
en: Figure 4).

source: рисунок 5).
en: Figure 5).

source: рисунок 5);
en: Figure 5);

source: рисунок 6).
en: Figure 6).

source: рисунок 7), в котором отображается:
en: Figure 7) which displays as follows:

source: рисунок 9).
en: Figure 9).

source: рисунок).
en: Figure).

source: руб.
en: rub.

source: руб. из опорной таблицы — назначения Поле с наименованиями и Поле с долями соответственно.
en: fields from the reference table will have the following usage types: Field with names and Field with quotas correspondingly.

source: руб. — сумма продаж для конкретный группы;
en: rub. — amount of sales of the particular group.

source: руб. из разгруппируемой таблицы выставим назначение Разгруппируемое, а полям Название товара и Сумма продаж, тыс.
en: rub. field from the ungroupable table will have the Ungroupable usage type, and Name of goods and Amount of sales, thous. rub.

source: с помощью кнопки Удалить все связи — удаляет все связи;
en: using Delete all links button, it deletes all links;

source: сентябрь
en: September

source: скобки, определяющие порядок выполнения операций;
en: brackets defining the order of operations execution;

source: следующий раздел "Видимость узлов").
en: the next section - "Visibility of nodes").

source: сначала по признаку: "совместим тип данных и совпадает имя (без учета регистра)";
en: first, by the following indicator: "data type is compatible and the name matches (case-insensitive)";

source: согласно очередности полей сортировки.
en: according to the order of the sort fields.

source: содержащиеся между (слеш-звездочка)
en: included between (slash-asterisk)

source: содержит
en: contains

source: сокращение размерности данных за счет исключения признаков с низкой значимостью, снижения разнообразия значений признаков;
en: Reduction of data dimensionality by excluding the indicators with low significance, by decreasing variety of indicator values.

source: сохранить пакет с измененным узлом;
en: Save the package with the changed node;

source: ссылки на другие переменные набора данных в виде наименования переменных или ранее вычисленных выражений;
en: references to other data set variables in the form of the variables names or earlier computed expressions;

source: ссылки на другие поля набора данных в виде наименования полей или ранее вычисленных выражений;
en: references to other data set fields in the form of the fields names or earlier calculated expressions;

source: ссылки на используемые измерения и факты куба в виде наименования измерений и фактов;
en: references to the used cube dimensions and measures in the form of dimensions and measures names;

source: ссылки на переменные входного порта;
en: references to the input port variables;

source: строка
en: string

source: строковые выражения в кавычках ("строковое выражение");
en: string expressions in quotation marks ("string expression");

source: строковые выражения в кавычках, например, "строковое выражение";
en: string expressions in quotation marks, for example, "string expression";

source: считаются все символы,
en: is represented by all characters

source: также Веб-сервисы).
en: Web Services).

source: также Работа с построенной диаграммой).
en: How to Use the Constructed Chart).

source: также: Горячие клавиши редактора кода
en: Code editor hotkeys

source: таким, значения которого упорядочены по возрастанию или убыванию (например, по дате или времени).
en: its values are ordered in ascending or descending order (for example, by date or time).

source: тип
en: type

source: только в первую строку, а в остальных строках для полей строкового и переменного типа будет выведено значение null, для полей остальных типов данных - пустая ячейка.
en: only to the first row, and the null value will be displayed in other rows for the fields related to the string and variable types, for the fields related to other types - empty cell.

source: трудоемкость некоторых алгоритмов Data Mining экспоненциально возрастает с увеличением объема данных.
en: complexity of some Data Mining algorithms is increased with data volume increase in an exponential manner.

source: удалять записи — исключить строки с аномальными значениями из набора данных;
en: Delete records: delete the records with anomalous values from data set.

source: узел должен быть видимым из корня сценария, т.е. в случае, если узел является вложенным (в подмодель или иерархию подмоделей), то у всех подмоделей, в которых он содержится, должен быть установлен модификатор доступа Открытый;
en: The node must be visible from the workflow root, namely, if the node is nested (into the supernode or hierarchy of supernodes), Public access modifier must be installed for all supernodes that include it;

source: унаследованные в результате создания производного узла;
en: inherited in the result of the derived node creation;

source: упрощение описания исследуемых объектов.
en: Simplification of description of the objects under study.
